models/autoports/mistralai_mistral_small_24b_instruct_2501/readiness_vllm/vllm_ci_serving_benchmark.log
INFO 08-13 21:17:50 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-13 21:17:50 [__init__.py:46] - tt -> vllm_tt_plugin.entrypoints:platform_plugin
INFO 08-13 21:17:50 [__init__.py:49] All plugins in this group will be loaded. Set `VLLM_PLUGINS` to control which plugins to load.
2026-08-13 21:17:51.811 | DEBUG    | ttnn:<module>:79 - Initial ttnn.CONFIG:
Config{cache_path=/home/mvasiljevic/.cache/ttnn,model_cache_path=/home/mvasiljevic/.cache/ttnn/models,tmp_dir=/tmp/ttnn,enable_model_cache=false,enable_fast_runtime_mode=true,throw_exception_on_fallback=false,enable_logging=false,enable_graph_report=false,enable_graph_python_stack_traces=false,enable_detailed_buffer_report=false,enable_detailed_tensor_report=false,enable_comparison_mode=false,comparison_mode_should_raise_exception=false,comparison_mode_pcc=0.9999,root_report_path=generated/ttnn/reports,report_name=std::nullopt,std::nullopt}
INFO 08-13 21:17:51 [__init__.py:212] Platform plugin tt is activated
INFO 08-13 21:17:54 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 08-13 21:17:54 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71abaab0a660>, trust_remote_code=False, seed=0, num_prompts=32, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=100, random_output_len=100, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='mistralai/Mistral-Small-24B-Instruct-2501', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/home/mvasiljevic/tt-metal/models/autoports/mistralai_mistral_small_24b_instruct_2501/readiness_vllm/vllm_ci_serving_result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-177c8e0d-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 08-13 21:17:56 [datasets.py:607] Sampling input_len from [99, 99] and output_len from [100, 100]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 32/32 [00:03<00:00, 10.27it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     32
Failed requests:                         0
Maximum request concurrency:             32
Benchmark duration (s):                  3.12
Total input tokens:                      3168
Total generated tokens:                  3200
Request throughput (req/s):              10.27
Output token throughput (tok/s):         1026.97
Peak output token throughput (tok/s):    1760.00
Peak concurrent requests:                32.00
Total token throughput (tok/s):          2043.68
---------------Time to First Token----------------
Mean TTFT (ms):                          1172.08
Median TTFT (ms):                        1191.70
P99 TTFT (ms):                           1192.84
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.62
Median TPOT (ms):                        19.42
P99 TPOT (ms):                           23.83
---------------Inter-token Latency----------------
Mean ITL (ms):                           19.62
Median ITL (ms):                         17.93
P99 ITL (ms):                            67.96
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3114.27
Median E2EL (ms):                        3114.21
P99 E2EL (ms):                           3115.30
==================================================
nanobind: leaked 92 instances!
 - leaked instance 0x278456e0 of type "ttnn._ttnn.operations.unary.sqrt_t"
 - leaked instance 0x71ac3e53b4c8 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x71ac3e23a928 of type "ttnn._ttnn.tensor.CoreCoord"
 - leaked instance 0x27372290 of type "ttnn._ttnn.operations.unary.exp2_t"
 - leaked instance 0x24d60970 of type "ttnn._ttnn.operations.unary.lez_t"
 - leaked instance 0x26fd4470 of type "ttnn._ttnn.operations.unary.gelu_t"
 - leaked instance 0x271d2030 of type "ttnn._ttnn.operations.unary.hardsigmoid_t"
 - leaked instance 0x71ac3e513f68 of type "ttnn._ttnn.operations.normalization.SoftmaxDefaultProgramConfig"
 - leaked instance 0x272a0120 of type "ttnn._ttnn.operations.unary.log10_t"
 - leaked instance 0x271a0c10 of type "ttnn._ttnn.operations.unary.multigammaln_t"
 - leaked instance 0x71ac3e53bd08 of type "ttnn._ttnn.tensor.MemoryConfig"
 - leaked instance 0x26ed56e0 of type "ttnn._ttnn.operations.unary.erfc_t"
 - leaked instance 0x270a9c60 of type "ttnn._ttnn.operations.unary.mish_t"
 - leaked instance 0x27928f50 of type "ttnn._ttnn.operations.unary.tan_t"
 - leaked instance 0x24d58460 of type "ttnn._ttnn.operations.unary.eqz_t"
 - leaked instance 0x26c23040 of type "ttnn._ttnn.operations.unary.sin_t"
 - leaked instance 0x274115b0 of type "ttnn._ttnn.operations.unary.softplus_t"
 - leaked instance 0x71ac3e02f8a8 of type "ttnn._ttnn.operations.sliding_window.Op2DSliceConfig"
 - leaked instance 0x26d15160 of type "ttnn._ttnn.operations.unary.atan_t"
 - leaked instance 0x278fc010 of type "ttnn._ttnn.operations.unary.log_sigmoid_t"
 - ... skipped remainder
nanobind: leaked 909 types!
 - leaked type "SocketEndpoint"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.gt__t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.SliceDeviceOperation"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.MatmulMultiCoreReuseMultiCastBatchedDRAMShardedProgramConfig"
 - leaked type "ttnn._ttnn.operations.binary.lt__t"
 - leaked type "ttnn._ttnn.operations.binary_backward.xlogy_bw_t"
 - leaked type "ttnn._ttnn.operations.experimental.insert_t"
 - leaked type "ttnn._ttnn.operations.experimental.quasar.isclose_t"
 - leaked type "ttnn._ttnn.operations.reduction.var_t"
 - leaked type "DispatchCoreAxis"
 - ... skipped remainder
nanobind: leaked 4183 functions!
 - leaked function "get_metadata_addr"
 - leaked function "__init__"
 - leaked function ""
 - leaked function ""
 - leaked function ""
 - leaked function "compute_output_specs"
 - leaked function ""
 - leaked function ""
 - leaked function "__setitem__"
 - leaked function "__init__"
 - ... skipped remainder
nanobind: this is likely caused by a reference counting issue in the binding code.
See https://nanobind.readthedocs.io/en/latest/refleaks.html